In [1]:
import requests
from bs4 import BeautifulSoup
import pandas as pd

In [2]:
url = "https://en.wikipedia.org/wiki/List_of_Mount_Everest_death_statistics"

In [3]:
def paso1(url):
    url1 = f"{url}"
    response = requests.get(url1)
    soup = BeautifulSoup(response.content)
    return  soup.find_all("table")

In [4]:
a = paso1(url)

# TABLE 1

In [5]:
table1 = a[0]

In [6]:
tbody1 = table1.find("tbody")

In [7]:
trs1 = tbody1.find_all("tr")

In [8]:
tr1 = trs1[1]

In [9]:
cols1 = tr1.find_all("td")

In [10]:
cols1[2].text.strip()

'2015 Mount Everest avalanches[27]'

In [11]:
def info_table1(row):
    
    info = dict()
    
    cols1 = row.find_all("td")
    
    info["Died"] = (cols1[0].text.strip())
    info["Date"] = int(cols1[1].text)
    return info

In [12]:
for i, row in enumerate(trs1):
    try:
        info_table1(row)
    except:
        print(i)

0

In [13]:
table1_ = pd.DataFrame([info_table1(row) for row in trs1[1:]])

# TABLE 2

In [14]:
table2 = a[1]

In [15]:
tbody2 = table2.find("tbody")

In [16]:
trs2 = tbody2.find_all("tr")

In [17]:
tr2 = trs2[1]

In [18]:
cols2 = tr2.find_all("td")

In [19]:
cols2[1].text.strip()

'111'

In [20]:
def info_table2(row):
    
    info = dict()
    
    cols2 = row.find_all("td")
    
    info["Nationality"] = (cols2[0].text.strip())
    info["Count"] = int(cols2[1].text)
    return info

In [21]:
for i, row in enumerate(trs2):
    try:
        info_table2(row)
    except:
        print(i)

0

In [22]:
table2_ = pd.DataFrame([info_table2(row) for row in trs2[1:]])

# TABLE 3

In [23]:
table3 = a[2]

In [24]:
tbody3 = table3.find("tbody")

In [25]:
trs3 = tbody3.find_all("tr")

In [26]:
tr3 = trs3[1]

In [27]:
cols3 = tr3.find_all("td")

In [28]:
cols3[1].text.strip()

'68'

In [29]:
def info_table3(row):
    
    info = dict()
    
    cols3 = row.find_all("td")
    
    info["Cause"] = (cols3[0].text.strip())
    info["Count"] = int(cols3[1].text)
    return info

In [30]:
for i, row in enumerate(trs3):
    try:
        info_table3(row)
    except:
        print(i)

0

In [31]:
table3_ = pd.DataFrame([info_table3(row) for row in trs3[1:]])

In [32]:
table1_.to_csv("Data/table1.csv")

In [33]:
table2_.to_csv("Data/table2.csv")

In [34]:
table3_.to_csv("Data/table3.csv")

In [35]:
table1_

    Died  Date
0  18–22  2015
1     16  2014
2   8–12  1996
3      6  1974
4      6  1970

In [36]:
table2_

                  Nationality  Count
0                       Nepal    111
1                       India     19
2                       Japan     19
3              United Kingdom     17
4               United States     15
5                       China     12
6                 South Korea     11
7                   Australia      7
8                     Germany      7
9                      Poland      7
10                     Russia      7
11                     Canada      6
12                     France      6
13             Czechoslovakia      5
14                      Spain      4
15                   Bulgaria      3
16                    Ireland      3
17                      Italy      3
18                New Zealand      3
19                Switzerland      3
20                    Austria      2
21             Czech Republic      2
22                    Denmark      2
23                    Hungary      2
24                   Slovenia      2
25                     Taiwan      2
26  Yugoslavia/ FR Yugoslavia      2
27              Other/Unknown     13

In [37]:
table3_

                         Cause  Count
0                    Avalanche     68
1                         Fall     67
2                     Exposure     27
3            Altitude sickness     21
4               Cardiac arrest     11
5   Exhaustion and/or exposure      8
6                   Exhaustion      7
7                        Serac      6
8              Cerebral oedema      7
9                       Stroke      2
10                   Frostbite      1
11                       Other     15
12               Unknown cause     52